{
  "home.course": "Angular course",
  "home.requirements": "Requirements",
  "home.using-the": "using the",
  "home.auth-system-text": "token is stored on the Local Storage of the browser",
  "home.pagination": "Pagination",
  "home.ang-mat-pagination-text": "- Using the angular material pagination widget. (see: https://material.angular.io/components/paginator/overview)",
  "home.home-text": "load the home component",
  "home.user-text": "lazy module who load the user list component",
  "home.user-id-text": "load page with specific user id",
  "home.login-text": "load the login component, allows the user to enter username and password",
  "home.register-text": "load lazy module to register a new user. (the 'reqres' API doesn't allow a new email to register, so an existing user email is provided but the password can be changed)",
  "home.wildcart-text": "load Not Found component if the user navigate to an unknow URL",
  "typescript-skills": "TypeScript knowledge",
  "home.enums-text": "An event system on the /users page is implementing. It defines if a user is being modified, updated, deleted (see: user-state.ts)",
  "home.generic-text": "A generic type is created to display the errors. The 'title' field can be a number or a string. (see: error.ts)",
  "home.behavior-subject-text": "BehaviorSubject is used in the project in few custom services to notify about an HTTP error, when the user is authenticated or not, or the language to use",
  "home.directive-text": "A custom directive has been implemented to change the color of the icon state in the user list(see: userState.directive.ts)",
  "home.ve-title": "View Encapsulation",
  "home.ve-text": "Shared components are used around the application , they using shadow view encapsulation (see: bottom-sheet.component.ts, spinner.component.ts)",
  "home.cd-text": "the user-list is using the OnPush detection",
  "home.interceptors-text": "interceptors are used for HTTP errors detection and send the user's token in HTTP header",
  "nav.user": "Current user",
  "users-page": "User Page",
  "user-processing": "Processing the user list, please wait",
  "Home": "Home",
  "Users": "Users",
  "Login": "Login",
  "home.translations-text": "Ngrx-translate with i18n is using for translations in english and french.(the home page, navigation and few items on the user list are actuallytranslated, it was to test different fonctionnalities for translation byazy loading, template translation and marker() feature)",
  "home.translations-text2": "The favorite langugage of the user is stored in the local storage of the browser"
}
