{
  "home.course": "Cours d'Angular",
  "home.requirements": "Spécification des exigences",
  "home.using-the": "en utilisant le",
  "home.auth-system-text": "le jeton est stocké sur le stockage local du navigateur",
  "home.pagination": "Pagination",
  "home.ang-mat-pagination-text": "- Utilisation du widget de pagination de 'angular material'. (voir: https: //material.angular.io/components/paginator/overview)",
  "home.home-text": "Chargement du composant /home",
  "home.user-text": "lazy module qui charge le composant pour manipulation des utilisateurs",
  "home.user-id-text": "charge la page avec un identifiant d'utilisateur spécifique",
  "home.login-text": "charge le composant de 'login', permet à l'utilisateur d'entrer le nom d'utilisateur et le mot de passe",
  "home.register-text": "charge le module paresseux pour enregistrer un nouvel utilisateur. (l'API 'reqres' ne permet pas d'ajouter un nouvel e-mail pour s'inscrire, un e-mail d'utilisateur existant est fourni mais le mot de passe peut être changé)",
  "home.wildcart-text": "charge le composant introuvable si l'utilisateur accède à une URL inconnu",
  "typescript-skills": "Connaissance en TypeScript",
  "home.enums-text": "Un système d'événements sur la page / users est en cours de mise en œuvre. Il définit si un utilisateur est en cours de modification, de mise à jour, de suppression (voir: user-state.ts)",
  "home.generic-text": "Un type générique est créé pour afficher les erreurs. Le champ «titre» peut être un nombre ou une chaîne de charactère. (voir: error.ts)",
  "home.behavior-subject-text": "BehaviorSubject est utilisé dans le projet dans quelques services personnalisés pour notifier une erreur HTTP, lorsque l'utilisateur est authentifié ou non, ou la langue à utiliser",
  "home.directive-text": "Une directive personnalisée a été implémentée pour changer la couleur de l'état de l'icône dans la liste des utilisateurs (voir: userState.directive.ts)",
  "home.ve-title": "View Encapsulation",
  "home.ve-text": "Les composants partagés sont utilisés autour de l'application, ils utilisent l'encapsulation 'Shadow' (voir: bottom-sheet.component.ts, spinner.component.ts)",
  "home.cd-text": "la liste des utilisateurs utilise OnPush détection",
  "home.interceptors-text": "interceptors sont utilisés pour la détection des erreurs HTTP et pour transmettre le token de l'utilisateur",
  "users-page": "User page",
  "user-processing": "Traitement de la liste des utilisateurs, veuillez patienter",
  "Home": "Accueil",
  "nav.user": "Utilisateur identifié",
  "Users": "Utilisateurs",
  "Login": "Connexion",
  "home.translations-text": "Ngrx-translate avec i18n est utilisé pour les traductions en anglais et en français. (la page d'accueil, la navigation et quelques éléments de la liste des utilisateurs sont traduit, il s'agit de tester les différentes fonctionnalités avec 'lazy loading', traduction dans le 'template' et fonctionnalité de marker()",
  "home.translations-text2": "The favorite lanngugage of the user is stored in the local storage of the browser"
}
